1、qml有哪些问题
避免定时轮询，采用信号槽机制通知
避免频繁的属性访问，
属性绑定，避免复杂计算
少使用属性绑定
属性设置使用异步加载

2、qt的元对象系统是什么
在Qt中，每个继承自QObject的类都具有元对象。元对象是一个描述类的结构和属性的数据结构，它包含了类的名称、父类的名称、类的属性、信号和槽等信息。通过元对象系统，我们可以在运行时获取和操作这些信息。
元对象系统的主要功能包括：
动态属性：通过元对象系统，我们可以在运行时为对象添加、修改和查询属性。这使得我们可以在不修改源代码的情况下，动态地为对象添加一些额外的属性。
信号和槽机制：元对象系统使得Qt的信号和槽机制成为可能。通过元对象系统，我们可以在运行时动态连接和断开信号和槽，实现对象之间的通信。
反射：元对象系统使得我们可以在运行时获取类的信息，包括类的名称、属性、信号和槽等。这使得我们可以实现一些高级特性，如对象的序列化和反序列化、动态创建对象等。

3、mvc架构：模型表示数据、view表示用户界面、controler定义了用户在界面上的操作

4、qtablewidget和qtableview的优点
qtablewidget：简单易用，自动调整大小
qtableview：数据和视图分离，数据处理更加邻国，可加载数据库，csv文件等，更高的性能，显示大量数据时更快，因为他只刷新当前页面显示的内容
